[
  {
    "name": "fabien",
    "familyName": "thiesset",
    "expertises": [
      "expert react.js & node.js",
      "développeur full-stack",
      "coordonnateur de projet"
    ],
    "description": "expérimenté en coordination de projet complexe pour la démarche humanitude, mon parcours d'aide soignant nourrit une approche pragmatique, humaine et sensible à la création de solution numérique accessible à tous.",
    "imageSrc": "/images/profile.webp",
    "imageAlt": "profile picture",
    "services": [
      {
        "icon": "Code",
        "item": "développement",
        "description": "react.js, node.js"
      },
      {
        "icon": "Waypoints",
        "item": "architecture",
        "description": "full-stack"
      },
      {
        "icon": "Layout",
        "item": "conception",
        "description": "d'application, de sites web"
      },
      {
        "icon": "Wrench",
        "item": "maintenance",
        "description": "corrective, évolutive"
      },
      { "icon": "Monitor", "item": "intégration", "description": "html css" },
      {
        "icon": "Users",
        "item": "agilité",
        "description": "développement en mode agile scrum"
      }
    ]
  },
  {
    "title": "à propos",
    "jobs": [
      {
        "name": "développeur",
        "description": "développeur full-stack orienté front-end, spécialisé dans la création d'applications web et mobile avec une expertise particulière des frameworks next.js et express.js. après une année d'expériences, nourrit d'une approche pragmatique, je développe des solutions numériques accessibles, en travaillant principalement avec typescript.",
        "skills": [
          "optimisation d'environnement de développement linux.",
          "conception, maquettage d'interface utilisateur intuitive.",
          "intégration d'interface utilisateur moderne, accessible.",
          "implémentation et intégrité de base de données postgresql.",
          "création de composant sécurisé d'accès à postgresql, mongodb.",
          "création de composant métier sécurisé et testé avec jest.",
          "rédaction de documentation technique et fonctionnelle en anglais.",
          "approche structurée de résolution de problème.",
          "apprentissage continu de l'anglais, du développement et veille technologique."
        ]
      },
      {
        "name": "coordinateur de projet | scrum master",
        "description": "Depuis 2018, j'ai enrichi mon parcours d'aide soignant en occupant le poste de coordinnateur de projet de la démarche humanitude, son label, et du quotidien de personne en situation de handicap, garantissant la qualité du prendre soin et le bien-être. j'ai aussi été scrum master pour notre projet de fin de formation.",
        "skills": [
          "facilitation de groupe autour de valeur commune, partage de bonnes pratiques et co-animation de comité stratégique.",
          "Gestion collaborative de la planification, suivi d'évaluation complexe (+200 critères) et adaptation rapide des processus.",
          "co-conception, test, optimisation de la plateforme ancodea.",
          "coordination efficace avec les équipes internes, externes, incluant l'IGM HDF, garantissant une communication fluide.",
          "élaboration et mise en oeuvre de stratégie adaptée à des contextes complexes, notamment en période de covid-19.",
          "instauration d'une culture collaborative basée sur l'écoute active, l'autonomie et le leadership positif."
        ]
      }
    ]
  },
  {
    "title": "portfolio",
    "description": "voici une collection de mes projets javascript récents, montrant le type de clients avec lesquels je collabore et les solutions que je propose.",
    "projects": [
      {
        "title": "portfolio",
        "organization": "rendu côté serveur",
        "description": "site vitrine de mon travail, mettant en avant mes projets et compétences en développement web.",
        "imageSrc": "images/portfolio.webp",
        "imageAlt": "Portfolio",
        "website": "fabuilds.netlify.app/",
        "github": "github.com/ThiessetFabien/ThiessetFabien.github.io",
        "tags": ["next.js", "tailwind css", "google apis"]
      },
      {
        "title": "casalink",
        "organization": "application monopage",
        "description": "application de planning familial pour gérer les tâches et événements avec délégation pour les enfants.",
        "imageSrc": "images/casalink.webp",
        "imageAlt": "Casalink",
        "videoSrc": "casalink.mp4",
        "website": "o-clock-muffin.github.io/projet-planning-familial-front/",
        "file": "documents/CDC-Casalink.pdf",
        "github": "github.com/ThiessetFabien/Casalink-Frontend",
        "tags": ["typescript", "react.js", "sass"]
      },
      {
        "title": "casalink api",
        "organization": "api restful",
        "description": "serveur sécurisé pour l'application casalink, gérant les données testées et authentifiées avec jwt.",
        "imageSrc": "images/casalink-documentation.webp",
        "imageAlt": "Casalink documentation",
        "website": "casalink-back.vercel.app/api-docs/",
        "github": "github.com/ThiessetFabien/Casalink-Backend",
        "tags": ["express.js", "postgresql", "jwt"]
      },
      {
        "title": "mailnager api",
        "organization": "api",
        "description": "serveur pour la gestion des mails et le suivi des emplois, créé pour un ami et ancien élève.",
        "imageSrc": "images/mailnager.webp",
        "imageAlt": "Casalink documentation",
        "github": "github.com/ThiessetFabien/MailNagerAPI",
        "tags": ["typescript", "nest.js", "mongodb"]
      }
    ],
    "icon1": "Mail",
    "cta1": "engagez-moi !",
    "href1": "#card-9",
    "cta2": "réseautons",
    "icon2": "Linkedin",
    "href2": "www.linkedin.com/in/fabien-thiesset/",
    "cta3": "travaillons ensemble",
    "icon3": "Github",
    "href3": "github.com/ThiessetFabien?tab=repositories"
  },
  {
    "title": "expériences",
    "description": "transformer une vision en réalité accessible avec du code et de l'humanité",
    "experiences": [
      {
        "job": "concepteur développeur de site web bénévole - next.js",
        "date": "avril 2025 - aujourd'hui",
        "company": "rigolo comme la vie",
        "location": "douai",
        "goal": "conception et développement du site vitrine de la directrice de crèche, infirmière experte de la petite enfance, proposant ses services d'accompagnement à la parentalité, de groupe d'analyse de pratique et de formation professionnelle.",
        "tasks": ["définition du besoin avec la cliente."],
        "role": "concepteur développeur full-stack.",
        "stack": ["next.js", "typescript", "tailwind css"],
        "skills": ["conception de site web", "méthode agile scrum"]
      },
      {
        "job": "concepteur développeur d'application bénévole - react native",
        "date": "janvier 2025 - aujourd'hui",
        "company": "association udapei59",
        "location": "thumeries",
        "goal": "développement d'un launcher d'application android adapté aux capacités cognitives et physiques d'une résidentes et facilitant l'accès aux applications d'appels, de musique et de jeux.",
        "tasks": [
          "définition du besoin et tests d'utilisation avec la cliente, l'ergothérapeute et l'éducateur spécialisé."
        ],
        "role": "concepteur développeur full-stack.",
        "stack": ["react native", "typescript", "tailwind css"],
        "skills": [
          "conception d'application mobile",
          "méthode agile scrum",
          "développement front-end",
          "développement back-end"
        ]
      },
      {
        "job": "fondateur et développeur de fabuilds - next.js",
        "date": "novembre 2024 - décembre 2024",
        "company": "projet personnel",
        "goal": "création d'un portfolio et d'un blog moderne présentant mes compétences, projets en développement web et mes articles.",
        "tasks": [
          "conception du cahier des charges et de la maquette.",
          "intégration responsive en mobile first en mode clair et sombre.",
          "création d'un carousel de recommandations d'anciens collaborateurs.",
          "optimisation des performances avec les lazy loading.",
          "réalisation de carte intégrant la vidéo de démonstration.",
          "développement adaptatif du menu burger et de la barre de navigation.",
          "implémentation d'une carte openstreetmap indiquant la mobilité.",
          "connexion sécurisée oauth2 à l'api google avec un formulaire."
        ],
        "role": "concepteur développeur full-stack.",
        "stack": [
          "next.js",
          "typescript",
          "tailwind css",
          "shadcn/ui",
          "openstreetmap",
          "google apis",
          "json",
          "embla",
          "lazygit",
          "oauth2",
          "github"
        ],
        "skills": [
          "développement front-end",
          "développement back-end sécurisé",
          "rédaction de documentation technique et fonctionnelle en anglais",
          "bonnes pratiques de développement",
          "intégration d'interface accessible",
          "seo",
          "notion",
          "draw.io"
        ]
      },
      {
        "job": "Développeur spécialisé react.js et intégration ++",
        "date": "septembre 2024 - octobre 2024",
        "company": "école o'clock",
        "location": "replay"
      },
      {
        "job": "développeur full-stack et scrum master - react.js/express.js",
        "date": "mai 2024 - juin 2024",
        "company": "projet fin formation école o'clock",
        "location": "téléprésentiel",
        "goal": "développement de l'application web Casalink permettant la gestion du planning familial d'un foyer avec délégation aux enfants.",
        "tasks": [
          "coordination de l'architecture du MVP et des conventions.",
          "formation de l'équipe aux bonnes pratiques colaboratives sur Notion.",
          "création de l'architecture et de composants back-end de l'api restful.",
          "maintenance corrective et évolutive facilitant le développement front-end.",
          "migration sécurisée de la base de données",
          "sécuration des données utilisateurs, gestion des erreurs et des logs.",
          "implémentation de la connexion json web token.",
          "intégration responsive en mobile first de la modale de code pin.",
          "facilitation, animation et suivi quotidien des rituels scrum."
        ],
        "role": "développeur full-stack et scrum master d'une équipe de cinq développeurs.",
        "stack": [
          "typescript",
          "react.js",
          "express.js",
          "postgresql",
          "sass",
          "sqitch",
          "jwt",
          "notion",
          "google sheets"
        ],
        "skills": [
          "développement front-end",
          "développement back-end sécurisé",
          "rédaction du cahier des charges et de la documentation de l'API en anglais.",
          "garant de l'agilité, des rites scrum de l'équipe de cinq développeurs."
        ]
      },
      {
        "job": "titre professionnel niveau 5 developpeur web et web mobile full-stack javascript (bac+2)",
        "date": "décembre 2023 - juillet 2024",
        "company": "école o'clock",
        "location": "téléprésentiel",
        "goal": "apprentissage intensif du développement web et web mobile avec le langage javascript, dans un cursus de six mois, 35 heures par semaine en réalisant des projets concrets, un projet de fin de formation en équipe.",
        "tasks": [
          "trois mois de socle: html, css, javascript, sql.",
          "un mois de spécialisation data api.",
          "un mois de projet de fin de formation en équipe.",
          "61 challenges quotidiens.",
          "cinq ateliers de pair-programming de deux apprenants.",
          "huit parkours de code chronométré."
        ],
        "role": "apprenant développeur full-stack.",
        "stack": [
          "html, css, javascript, react.js, node.js, express.js, postgresql, mongodb, docker, sqitch, graphql."
        ],
        "skills": [
          "installer et configurer son environnement de travail en fonction du projet",
          "maquetter des interfaces utilisateur",
          "réaliser des interfaces statiques",
          "développer la partie dynamique des interfaces",
          "mettre en place une base de données relationnelle",
          "développer des composants d'accès aux données sql et nosql",
          "développer des composants métier côté serveur",
          "documenter le déploiement d'une application dynamique",
          "communiquer",
          "metter en oeuvre une démarche de résolution de problème",
          "apprentissage continue"
        ]
      },
      {
        "job": "stagiaire développeur front-end",
        "date": "juillet 2023",
        "company": "Chimenbou, Entreprise individuelle",
        "location": "télétravail",
        "goal": "conception et intégration de la plateforme collaborative dev brother favorisant l'apprentissage des bases en programmation, en cybersécurité et en conception 3d.",
        "tasks": [
          "conception de la moodboard et la maquette.",
          "réalisation d'assets graphiques personnalisées par prompt engineering.",
          "intégration responsive en mobile first respectant les normes w3c.",
          "versionnage du code avec github desktop.",
          "découverte du langage de programmation javascript."
        ],
        "role": "stagiaire développeur front-end.",
        "stack": [
          "javascript",
          "html",
          "css",
          "notion",
          "google slide",
          "figma",
          "dall-e",
          "github desktop"
        ],
        "skills": [
          "conception de site web",
          "intégration responsive en mobile first",
          "développement front-end"
        ]
      },
      {
        "job": "financement de la formation de développeur web et web mobile full-stack javascript à l'école o'clock",
        "date": "avril 2023 - septembre 2023",
        "company": "transition pro hauts-de-france",
        "location": "téléprésentiel",
        "goal": "remplissage du dossier d'autopositionnement et la plateforme de transition limité à 4000 caractères afin d'obtenir le financement de la formation de développeur web et web mobile full-stack javascript à l'école o'clock et le maintien de salaire durant celle-ci.",
        "tasks": [
          "description du métier de développeur web et mobile",
          "présentation de la cohérence du projet de changement de métier/profession",
          "présentation de la pertinence du parcours de formation retenu, des modalités et de son financement",
          "présentation des perspectives d'emploi à l'issue du parcours de formation"
        ],
        "role": "demandeur de financement de formation."
      },
      {
        "job": "référent bien-être et aide soignant",
        "date": "septembre 2024 - aujourd'hui",
        "company": "association udapei59",
        "location": "thumeries",
        "goal": "analyse les besoins d'onze personnes accueillies porteuses de déficiences mentales et/ou physiques, et propose des solutions adaptées en collaborant avec l'équipe pluridisciplinaire de 25 professionnels."
      },
      {
        "job": "référent vie quotidienne et aide soignant",
        "date": "avril 2023 - décembre 2023",
        "company": "association centre hélène borel",
        "location": "raimbeaucourt",
        "goal": "structure, organise et suit le quotidien de 52 personnes accueillies porteuses de déficiences physiques en garantissant la qualité du prendre soin et le bien-être en collaborant avec l'équipe pluridisciplinaire de 38 professionnels et les divers services transversaux."
      },
      {
        "job": "autoformation html/css/javascript et node.js",
        "date": "février 2023 - décembre 2023",
        "company": "grafikart",
        "location": "en ligne"
      },
      {
        "job": "coordonnateur de la démarche humanitude et aide soignant",
        "date": "février 2018 - avril 2023",
        "company": "association centre hélène borel",
        "location": "raimbeaucourt",
        "goal": "optimise la communication entre 56 personnes accueillies porteuse de déficiences physiques, 38 professionnels et les services transversaux en la coordination les projets complexes, de la gestion de la qualité, de l'obtention et du maintien du label de 500 critères et 200 indicateurs dans le premier foyer d'accueil médicalisé de france métropolitaine.",
        "tasks": [
          "facilitation de groupe autour de valeurs communes.",
          "partage de bonnes pratiques",
          "co-animation de comité stratégique.",
          "gestion collaborative de la planification.",
          "suivi d'évaluation complexe de plus de 500 critères et 200 indicateurs.",
          "co-conception, test, optimisation de la plateforme ancodea.",
          "coordination efficace avec les équipes internes, transversales et le réseau humanitude.",
          "élaboration et mise en oeuvre de stratégie adaptée à des contextes complexes (covid-19).",
          "instauration d'une culture collaborative basée sur l'écoute active, l'autonomie et le leadership positif."
        ],
        "skills": ["méthodologie Gantt", "notion", "microsoft office"]
      },
      {
        "job": "aide soignant",
        "date": "décembre 2009 - février 2018",
        "company": "association centre hélène borel",
        "location": "raimbeaucourt, lomme",
        "goal": "assure la continuité des soins et le bien-être de personnes accueillies porteuses de déficiences physiques en collaborant avec l'équipe pluridisciplinaire."
      }
    ]
  },
  {
    "title": "parlons de vos projets",
    "testimonials": [
      {
        "author": "dupoirier christophe",
        "job": "product leader, jury professionnel",
        "company": "renault",
        "content": "J'ai eu la chance d'évaluer Fabien lors de sa soutenance en Juillet 2024 en tant que juré professionnel et je confirme que son niveau de connaissance technique et la qualité du cheminement intellectuel pour la conception de son projet font de lui un candidat sérieux pour occuper un poste de développeur Full Stack.   C'est une conversion professionnelle parfaitement réussie puisque Fabien exerçait auparavant un travail d'Aide Soignant en milieu médical. Ce qui démontre son implication sans faille et une véritable posture professionnelle.",
        "imageSrc": "media.licdn.com/dms/image/v2/C4D03AQGo1hIPNYYsSg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1608645411974?e=1748476800etv=betaett=SCxyt_hsjjt6sd7AcZEgalwIGawFCa_CrDqQNBI4iGQ",
        "linkedin": "www.linkedin.com/in/dupoirier-christophe-43aa3363/"
      },
      {
        "author": "alexis vignot",
        "job": "développeur, collègue projet de fin de formation",
        "company": "école o'clock",
        "content": "J’ai eu le plaisir de travailler avec Fabien Thiesset sur le projet Casalink, et je ne peux que louer ses compétences et son professionnalisme en tant que développeur fullstack. Fabien a démontré une maîtrise des technologies front-end et back-end, ce qui a été crucial pour le succès de notre projet. Son approche méthodique et sa capacité à résoudre des problèmes complexes ont permis de surmonter de nombreux défis techniques. De plus, Fabien est un excellent communicant, toujours prêt à partager ses connaissances et à collaborer efficacement avec l’équipe. Je recommande vivement Fabien pour toute opportunité future. Sa passion pour le développement et son engagement envers l’excellence en font un atout précieux pour n’importe quel projet.",
        "imageSrc": "media.licdn.com/dms/image/v2/C4D03AQHqNUcI0AfaNQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1624568924087?e=1748476800etv=betaett=4D8mZ_QxctfTxY5_miGi9E_da0vJART9MqSlklXxHpQ",
        "linkedin": "www.linkedin.com/in/alexis-vignot/"
      },
      {
        "author": "nicolas zanforlini",
        "job": "lead developpeur, formateur, jury professionnel DWWM",
        "company": "freelance",
        "content": "je recommande Fabien, j'ai eu l'occasion d'évaluer ses compétences lors du passage de son diplôme, c'est un jeune homme motivé, compétent et curieux, il est un atout au sein d'une équipe avec une bonne communication. Je recommande fortement.",
        "imageSrc": "media.licdn.com/dms/image/v2/C4D03AQG9eTvW6wRapQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1639988026836?e=1748476800etv=betaett=dkcLXrXpW24qfwK8pUFoW5BSztPumqIZY8uvZRma5mI",
        "linkedin": "https://www.linkedin.com/in/nicolas-zanforlini-5a06b518b/"
      },
      {
        "author": "adrien delcroix",
        "job": "référent pédagogique",
        "company": "école o'clock",
        "content": "J'ai eu l'occasion de suivre Fabien pendant sa formation en développement web, et il s'est démarqué par son sérieux et sa motivation. Toujours positif et appliqué, il a su relever chaque défi avec brio, en travaillant de manière autonome tout en étant à l'aise en équipe. Fabien a également montré une grande capacité à surmonter les difficultés techniques, cherchant toujours des solutions efficaces. Son esprit d'équipe et son implication ont été essentiels lors des projets collaboratifs. Je le recommande sans hésitation pour tout poste en développement web !",
        "imageSrc": "media.licdn.com/dms/image/v2/D4E03AQF0F6WT0DO1ng/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1709198087943?e=1748476800etv=betaett=aptbtjYuTVwKlOfUMeuEdnV3uljiowtBf8LvglhO2To",
        "linkedin": "www.linkedin.com/in/adrien-delcroix/"
      },
      {
        "author": "benoît schiex",
        "job": "développeur, formateur",
        "company": "école o'clock",
        "content": "Ayant suivi Fabien du lors de sa formation, j’ai pu noter ses qualités de rigueur et d’investissement qui lui ont permis à la fin de son parcours d’accéder à un excellent niveau de conception et de développement d’applications Web. Les projets réalisés ont démontré la compréhension des besoins dont la réponse technique a toujours été de qualité aussi bien dans les choix que dans la mise en application. Sa curiosité et sa rigueur ont été la base de la réussite de sa formation. Je me tiens à votre disposition pour toute demande d'information complémentaire concernant Fabien.",
        "imageSrc": "media.licdn.com/dms/image/v2/C4E03AQEDFeanJjJWyQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1544974008196?e=1748476800etv=betaett=-im8HlVqmEKU5wNvGhSEUP7lWfLnJWptHbvU-vHq71Q",
        "linkedin": "www.linkedin.com/in/beno%C3%AEt-schiex-1228745/"
      },
      {
        "author": "emilie suray",
        "job": "responsable qualité, gestion des risques, DPO",
        "company": "centre hélène borel",
        "content": "Fabien a démontré une belle capacité à se réinventer en passant du métier de coordonnateur à celui de développeur. J’ai eu l’occasion de travailler avec lui, et son sérieux, sa rigueur, ainsi que ses compétences relationnelles font de lui un collaborateur précieux. Sa reconversion témoigne de sa motivation et de son aptitude à apprendre rapidement. Fabien apporte une sensibilité humaine à ses projets, ce qui, combiné à sa nouvelle expertise technique, est un atout indéniable pour toute équipe.",
        "imageSrc": "media.licdn.com/dms/image/v2/C4D03AQGxWzN86GjqZA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1573585439996?e=1748476800etv=betaett=gyko4_vPK7-SP3GXHBPXUGTqBPqfa-HkSEX4L62Q4v4",
        "linkedin": "www.linkedin.com/in/emilie-s-065196130/"
      },
      {
        "author": "anthony goguillon",
        "job": "technicien informatique",
        "company": "centre hélène borel",
        "content": "En tant que technicien informatique , j'ai eu à plusieurs reprises le plaisir de travailler avec Fabien sur des problématiques d'ordre informatique. Fabien sait parfaitement exprimer les besoins d'autres utilisateurs et les retranscrire de manière simple et efficace , cela permet une résolution plus rapide. Ce qu'on apprécie aussi chez Fabien c'est son appétence pour la technologie , une vrai passion lui permettant d'être force de proposition. Sans oublier ses qualités humaines , sa rigueur , sa volonté de faire avancer les choses et bien sûr sa bonne humeur.",
        "imageSrc": "media.licdn.com/dms/image/v2/D4D03AQE8GtOEfBs6Mw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1712083084075?e=1749686400&v=beta&t=VcmCUuVqstztEhpf29U4LDI4Ngx43oM8qRIOjqYzuOY",
        "linkedin": "www.linkedin.com/in/anthony-goguillon-a0464565/"
      },
      {
        "author": "sylvette depreux",
        "job": "responsable système d'information",
        "company": "centre hélène borel",
        "content": "Responsable du service informatique, j’ai travaillé avec Fabien référent informatique pour son établissement de santé : Fabien faisait le lien entre les besoins émis par les utilisateurs des métiers du foyer et le service informatique. Ainsi, il me faisait part des demandes d’amélioration, des demandes d’évolution des logiciels métiers et du matériel nécessaire. Fabien réalisait aussi des statistiques à partir des données du système d’information. Fabien était un collaborateur investi, capable de faire le lien entre le service informatique et l’établissement dans lequel il travaillait. La collaboration a été efficace, permettant d’améliorer la qualité du service rendu pour les utilisateurs. Fabien est un collaborateur posé capable de prendre du recul et de suggérer des solutions.",
        "imageSrc": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
        "linkedin": "https://www.linkedin.com/in/sylvette-depreux-b43412135/"
      }
    ],
    "map": true
  }
]
